#include <array>

namespace ZHTW {
	const std::array strings = {
		//Main Menu
		"刪除設定",
		"刪除修正檔",
		"SaltyNX 未運作！",
		"無法在 SD 卡上偵測到 NX-FPS 外掛！",
		"遊戲未執行！",
		"全部",
		"所有內容",
		"遊戲列表",
		"螢幕設定",
		"遊戲已關閉！覆蓋介面已停用！",
		"遊戲未執行！覆蓋介面已停用！",
		"遊戲正在執行。",
		"NX-FPS 未運作！",
		"NX-FPS 正在運作，等待影格訊號。",
		"請重啟覆蓋介面以再次檢查。",
		"NX-FPS 正在運作。",
		"修正檔現正強制使用 60 Hz。",
		"增加 FPS 目標",
		"減少 FPS 目標",
		"變更 FPS 目標",
		"停用自訂 FPS 目標",
		"進階設定",
		"間隔模式：\n\uE019 0 (未使用)",
		"間隔模式：\n\uE019 %d (%.1f FPS)",
		"間隔模式：\n\uE019 %d (%d FPS)",
		"間隔模式：\n\uE019 %d (錯誤)",
		"自訂 FPS 目標：\n\uE019 已停用",
		"自訂 FPS 目標：\n\uE019 %d",

		//Advanced Settings
		"設定緩衝 (Buffering)",
		"將於下次啟動遊戲時套用。",
		"雙重 (Double)",
		"三重 (Triple)",
		"三重 (強制)",
		"四重 (強制)",
		"四重 (Quadruple)",
		"NVN 視窗同步等待 (Window Sync Wait)",
		"模式",
		"已啟用",
		"半啟用",
		"已停用",
		"開",
		"關",
		"半",
		"找不到遊戲設定檔\nTID: %016lX\nBID: %016lX",
		"遊戲設定錯誤：0x%X",
		"修正檔不存在。\n請使用「將設定轉為修正檔」\n來製作！",
		"修正檔不存在。",
		"新設定下載成功。\n請使用「將設定轉為修正檔」\n使其生效！",
		"修正檔已存在。",
		"GPU API 介面：NVN",
		"視窗同步等待 (Window Sync Wait)",
		"GPU API 介面：EGL",
		"GPU API 介面：Vulkan",
		"FPSLocker 修正檔",
		"發現有效的設定檔！",
		"轉換後請記得重新啟動遊戲！",
		"將設定轉為修正檔",
		"修正檔建立成功。\n請重啟遊戲並變更\nFPS 目標以套用修正檔！",
		"建立修正檔時發生錯誤：0x%x",
		"刪除修正檔",
		"修正檔已成功刪除。",
		"這可能需要長達 %d 秒。",
		"檢查/下載設定檔",
		"正在檢查 Warehouse 資料庫中的設定...",
		"其他",
		"暫停非焦點視窗的遊戲",
		"修正檔已載入至遊戲。",
		"Master Write 已載入至遊戲。",
		"外掛未將修正檔套用至遊戲。",
		"Set/作用中/可用緩衝：%d/%d/%d",
		"作用中緩衝：%d",
		"連線逾時！",
		"無可用的設定！RC: 0x%x",
		"無可用的設定！\n正在檢查 Warehouse 資料庫以獲取更多資訊...",
		"無可用的設定！\n正在檢查 Warehouse 資料庫以獲取更多資訊...\n逾時！檢查過程耗時過長。",
		"無可用的設定！\n正在檢查 Warehouse 資料庫以獲取更多資訊...\n連線錯誤！",
		"沒有新的設定檔可用。",
		"無法連線至網際網路！",
		"此遊戲不需要修正檔！",
		"Warehouse 資料庫中未列出此遊戲！",
		"Warehouse 資料庫中有此遊戲，\n但版本不同。\n%s 不需要修正檔，\n您的版本可能也不需要！",
		"Warehouse 資料庫中有此遊戲，\n但版本不同。\n%s 建議使用修正檔，\n但即使是該版本也沒有可用的設定！",
		"Warehouse 資料庫中有此遊戲，\n但版本不同。\n%s 有可用的設定！",
		"Warehouse 資料庫中有此遊戲，\n且建議此版本使用修正檔，\n但目前沒有可用的設定！",
		"連線錯誤！RC: 0x%x",
		
		//Display Settings
		"跳格 (Frameskip) 測試器",

		"使用方法：\n"
		"1. 準備一台可手動設定快門速度\n"
		"和 ISO 的相機。\n"
		"2. 將快門速度設為 1/10 秒或更長，\n"
		"並調整 ISO 避免畫面太亮或太暗\n"
		"(1/10 秒通常設為 ISO 50 左右)。\n"
		"3. 按下 \uE0E0 繼續。\n"
		"4. 對螢幕拍照。\n"
		"5. 如果除了第一個和最後一個區塊外，\n"
		"所有區塊亮度不均，代表您的螢幕\n"
		"原生不支援目前的更新率，\n"
		"並正以其他更新率運作。\n\n"
		"請注意，即使螢幕有跳格現象，\n"
		"其效果仍遠優於使用不符合螢幕更新率\n"
		"的低 FPS 目標，因為硬體解決方案\n"
		"才是平均分配影格時間的最佳方式。",

		"按下 \uE0E1 離開",
		"渲染耗時過長！\n請關閉遊戲，回到主畫面，\n再試一次。",
		
		"此選單將遍歷所有低於 60 Hz\n"
		"的支援更新率：\n"
		"40, 45, 50, 55。請按下系統要求的按鍵\n"
		"以確認該更新率運作正常。\n"
		"若 15 秒內無任何操作，\n"
		"將會檢查下一個更新率。",

		"按 X 開始。",
		"螢幕降頻精靈",
		"不支援 %dp！",
		"請先關閉遊戲！",
		"若 %d Hz 運作正常，請按 ZL。",
		"若 %d Hz 運作正常，請按 X。",
		"若 %d Hz 運作正常，請按 Y。",
		"若 %d Hz 運作正常，請按 ZR。",

		"此選單將遍歷所有高於 60 Hz\n"
		"直到 %d Hz 的支援更新率。\n\n"
		"請按下系統要求的按鍵\n"
		"以確認該更新率運作正常。\n"
		"若 10 秒內無任何操作，\n"
		"將會檢查下一個更新率。\n"
		"這可能需要長達 %d 秒。",

		"螢幕超頻精靈",
		"底座模式 %dp 螢幕手動設定",
		"底座模式螢幕其他設定",
		"允許修正檔強制使用 60 Hz",
		"針對不匹配的 FPS 目標使用最低更新率",
		"不適用",
		"最大可用更新率：%u Hz\nmyDP 連結速率：%s\n設定 ID：%08X",
		"底座模式螢幕設定",

		"允許的 %dp 更新率",
		"%dp 超頻精靈",
		"其他設定",

		"您目前不在底座模式。\n"
		"請返回，將主機放入底座，\n"
		"然後再回來。",

		"變更更新率 (Refresh Rate)",
		"增加更新率",
		"減少更新率",
		"使更新率與 FPS 目標匹配。",
		"手持模式螢幕同步",
		"底座模式設定",
		"復古重製 (Retro Remake) 模式",
		"螢幕更新率：%d Hz",

		"這是實驗性功能！\n\n"
		"這可能會對您的螢幕造成\n"
		"無法修復的損害。\n\n"
		"按下「接受」即代表您願意承擔\n"
		"使用此工具可能引發的任何後果\n"
		"之全部責任。",

		"螢幕設定警告",
		"拒絕",
		"接受",
		"強制使用英文介面",
		"底座模式螢幕同步",
		"僅限手持模式",
		"HOME 選單使用 60 Hz"
	};

	const std::array teslaStrings = {
	   "返回",
	   "確定" 
	};

	static_assert(teslaStrings.size() == 2);
}
