#include <array>

namespace ZHTW {
	std::array strings = {
		//Main Menu
		"刪除設定",
		"刪除補丁",
		"SaltyNX沒有執行!",
		"未在sdcard中檢查到NX-FPS插件!",
		"遊戲未執行!",
		"所有遊戲",
		"所有遊戲",
		"遊戲清單",
		"螢幕設定",
		"切換目標 FPS",
		"遊戲已關閉! FPSLocker已停用!",
		"遊戲未執行! FPSLocker已停用!",
		"遊戲正在執行.",
		"NX-FPS未執行!",
		"NX-FPS正在執行, 等待遊戲帧.",
		"重新進入FPSLocker以再次檢查.",
		"NX-FPS正在執行.",
		"補丁目前強制60Hz模式",
		"增加目標FPS",
		"減少目標FPS",
		"切換目標FPS",
		"停用自訂目標FPS",
		"進階設定",
		"儲存目前設定",
		"更新率分頻器:\n\uE019 0 (Unused)",
		"更新率分頻器:\n\uE019 %d (%.1f FPS)",
		"更新率分頻器:\n\uE019 %d (%d FPS)",
		"更新率分頻器:\n\uE019 %d (Wrong)",
		"自訂目標FPS:\n\uE019 未啟用",
		"自訂目標FPS:\n\uE019 %d",

		//Advanced Settings
		"設定帧緩衝",
		"設定將在下次遊戲啟動時生效.",
		"修改後請儲存目前設定.",
		"雙重緩衝",
		"三重緩衝",
		"強制三重緩衝",
		"強制四重緩衝",
		"四重緩衝",
		"NVN垂直同步",
		"模式",
		"啟動",
		"半同步",
		"停用",
		"開啟",
		"關閉",
		"半同步",
		"無法找到設定檔\nTID: %016lX\nBID: %016lX",
		"設定檔錯誤: 0x%X",
		"補丁不存在.\n請使用\"轉換設定檔到補丁\"\n來建立補丁!",
		"補丁不存在.",
		"新設定檔已下載.\n請使用\"轉換設定檔到補丁\"\n來使其生效!",
		"補丁已存在.",
		"進階設定",
		"圖形API: NVN",
		"垂直同步",
		"圖形API: EGL",
		"圖形API: Vulkan",
		"FPSLocker遊戲補丁",
		"找到有效的設定檔!",
		"請在轉換設定檔到補丁後重新啟動遊戲!",
		"轉換設定檔到補丁",
		"成功建立補丁.\n請重新啟動遊戲並修改\n目標FPS來應用補丁!",
		"建立補丁時發生錯誤: 0x%x",
		"刪除補丁",
		"補丁已成功刪除.",
		"這可能需要最多30秒.",
		"正在下載遊戲設定檔",
		"正在從Warehouse內尋找設定檔...\n完成前將不能退出!",
		"雜項",
		"暫停背景遊戲",
		"遊戲補丁已載入.",
		"Master Write已載入.",
		"遊戲補丁未生效.",
		"Set/目前/可用 帧緩衝: %d/%d/%d",
		"目前帧緩衝: %d",
		"連線逾時!",
		"設定檔不可用! RC: 0x%x",
		"設定檔不可用!\n正在檢查Warehouse...\n完成前將不能退出!",
		"設定檔不可用!\n正在檢查Warehouse...\n取得資料逾時!",
		"設定檔不可用!\n正在檢查Warehouse...\n發生連線錯誤!",
		"沒有新設定檔可用.",
		"無可用網路連線!",
		"這個遊戲不需要補丁!",
		"Warehouse內未包含這個遊戲!",
		"Warehouse內包含遊戲的不同版本.\n另一版本不需要補丁,\n你的版本也可能不需要!",
		"Warehouse內包含遊戲的不同版本.\n另一版本需要使用補丁,\n但也沒有可用的設定檔!",
		"Warehouse內包含遊戲的不同版本.\n存在另一版本的設定檔!",
		"Warehouse內包含這個遊戲\n且這個版本的遊戲需要使用補丁,\n但沒有可用的設定檔!",
		"發生連線錯誤! RC: 0x%x",
		
		//Display Settings
		"跳帧測試器",

		"如何使用:\n"
		"1. 請找一個可以手動設定快門速度\n"
		"   和ISO(感光度)的照相機.\n"
		"2. 設定快門速度到1/10秒或更長,\n"
		"   並且設定ISO使畫面亮度適中\n"
		"   (通常, 1/10秒快門和ISO50運作良好).\n"
		"3. 按下 \uE0E0 來測試.\n"
		"4. 拍下螢幕的照片.\n"
		"5. 如果拍攝到的除了第一個和最後一個\n"
		"   的所有區塊, 沒有均勻地亮起\n"
		"   則你的螢幕不原生支援目前更新率\n\n"
		"   在切換到其他更新率和FPS前請考慮\n"
		"   即使你的螢幕正在跳帧,\n"
		"   通常情況下, 比起更低的平均FPS\n"
		"   執行在更高的更新率下, 就視覺流暢度\n"
		"   仍為螢幕跳帧較好, 因為內建的\n"
		"   硬體跳帧方案會輸出更均勻的帧時間",

		"按 \uE0E1 來退出",
		"帧渲染耗時太長!\n請到主螢幕重新啟動遊戲並重試.",
		
		"這個選單將會測試60Hz以下的更新率\n"
		"順序為40/45/50/55Hz.\n"
		"你需要在出現提示的15秒內按下手把上的對應按鍵\n"
		"來確認目前螢幕可以在測試中的更新率正常顯示.\n"
		"如果15秒內沒有輸入則會測試下一個更新率.",

		"請按下 X 鍵來開始.",
		"螢幕降頻助手",
		"在 %dp 解析度下不支援!",
		"請先關閉遊戲!",
		"請按下 ZL 來確認你的螢幕支援40Hz.",
		"請按下 X 來確認你的螢幕支援%dHz.",
		"請按下 Y 來確認你的螢幕支援%dHz.",
		"請按下 ZR 來確認你的螢幕支援%dHz.",

		"這個選單將會測試60Hz到%dHz的更新率.\n"
		"這項測試僅對1080p解析度有意義\n"
		"因為在720p或更低的解析度下\n"
		"不存在頻寬問題, 一切應運作良好\n\n"
		"你需要在出現提示的10秒內按下手把上的對應按鍵\n"
		"來確認目前更新率可以在測試中的解析度正常顯示.\n"
		"如果10秒內沒有輸入則會測試下一個更新率.\n"
		"這項測試最多會持續%d秒.",

		"螢幕超頻助手",
		"底座模式1080p螢幕手動設定",
		"底座模式螢幕更多設定",
		"允許補丁強制60Hz模式",
		"對於不匹配的目標FPS\n使用最低可用的更新率.",
		"n/d",
		"回報的最大可用更新率: %uHz\nmyDP連結速率: %s\n設定檔ID: %08X",
		"底座模式螢幕設定",

		"在1080p下允許使用的更新率",
		"1080p超頻助手",
		"更多設定",

		"現在沒有連接到底座.\n"
		"請將你的主機連接到底座後\n"
		"再試一次.",

		"變更更新率",
		"增加更新率",
		"減少更新率",
		"將更新率與目標FPS同步.",
		"更新率同步",
		"底座模式設定",
		"Retro Remake模式",
		"目前螢幕更新率: %dHz",

		"警告: 這是實驗性的功能!\n\n"
		"如果使用不當, 這個功能可能\n"
		"對螢幕硬體造成永久性的損壞.\n\n"
		"如果按下\"同意\", 你知曉並同意:\n"
		"對於使用本工具中造成的任何問題,\n"
		"將由你承擔全部責任.",

		"螢幕進階設定警告",
		"拒絕",
		"同意",
		"強制使用英文作為顯示語言"
	};

	std::array teslaStrings = {
	   "返回",
	   "確定" 
	};

	static_assert(teslaStrings.size() == 2);
	static_assert(strings.size() == 128);
}